Revit 2027 API
XYZ Constructor
Overload List
Name | Description
XYZ() | Creates a default XYZ with the values (0, 0, 0).
XYZ(Double, Double, Double) | Creates an XYZ with the supplied coordinates.
Top
See Also
Reference
XYZ Class
Autodesk.Revit.DB Namespace